/*
Source Server         : action_test
Source Server Type    : MySQL
Source Server Version : 80025
Source Host           : localhost:3306
Source Schema         : action

Target Server Type    : MySQL
Target Server Version : 80025
File Encoding         : 65001

Date: 27/02/2026 00:14:36
*/

SET NAMES utf8mb4;

SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for address
-- ----------------------------
DROP TABLE IF EXISTS `address`;

CREATE TABLE `address` (
    `AddressId` int DEFAULT NULL,
    `PersonId` int DEFAULT NULL,
    `City` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
    `State` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of address
-- ----------------------------
BEGIN;

INSERT INTO
    `address` (
        `AddressId`,
        `PersonId`,
        `City`,
        `State`
    )
VALUES (
        1,
        2,
        'New York City',
        'New York'
    );

COMMIT;

-- ----------------------------
-- Table structure for asset_grades
-- ----------------------------
DROP TABLE IF EXISTS `asset_grades`;

CREATE TABLE `asset_grades` (
    `asset_level` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '身高等级',
    `asset_lowest` float(8, 2) NOT NULL COMMENT '该等级范围中的最低身高',
    `asset_highest` float(8, 2) NOT NULL COMMENT '该等级范围中的最高身高'
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of asset_grades
-- ----------------------------
BEGIN;

INSERT INTO
    `asset_grades` (
        `asset_level`,
        `asset_lowest`,
        `asset_highest`
    )
VALUES ('A', 8000.00, 10000.00);

INSERT INTO
    `asset_grades` (
        `asset_level`,
        `asset_lowest`,
        `asset_highest`
    )
VALUES ('B', 7000.00, 8000.00);

INSERT INTO
    `asset_grades` (
        `asset_level`,
        `asset_lowest`,
        `asset_highest`
    )
VALUES ('C', 6000.00, 7000.00);

INSERT INTO
    `asset_grades` (
        `asset_level`,
        `asset_lowest`,
        `asset_highest`
    )
VALUES ('D', 0.00, 6000.00);

COMMIT;

-- ----------------------------
-- Table structure for bank
-- ----------------------------
DROP TABLE IF EXISTS `bank`;

CREATE TABLE `bank` (
    `bank_id` int NOT NULL COMMENT '球队ID',
    `bank_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '球队名称',
    PRIMARY KEY (`bank_id`) USING BTREE
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of bank
-- ----------------------------
BEGIN;

INSERT INTO `bank` (`bank_id`, `bank_name`) VALUES (1001, '北京分行');

INSERT INTO `bank` (`bank_id`, `bank_name`) VALUES (1002, '上海分行');

INSERT INTO `bank` (`bank_id`, `bank_name`) VALUES (1003, '郑州分行');

INSERT INTO `bank` (`bank_id`, `bank_name`) VALUES (1004, '广州分行');

COMMIT;

-- ----------------------------
-- Table structure for car_sales
-- ----------------------------
DROP TABLE IF EXISTS `car_sales`;

CREATE TABLE `car_sales` (
    `序号` int DEFAULT NULL,
    `地区` varchar(255) DEFAULT NULL,
    `城市` varchar(255) DEFAULT NULL,
    `销售日期` date DEFAULT NULL,
    `品牌` varchar(255) DEFAULT NULL,
    `车系` varchar(255) DEFAULT NULL,
    `车型` varchar(255) DEFAULT NULL,
    `销量` int DEFAULT NULL,
    `价格(万)` int DEFAULT NULL,
    `销售额(万)` int DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of car_sales
-- ----------------------------
BEGIN;

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        1,
        '华东',
        '上海',
        '2019-05-31',
        '丰田',
        '亦泽IZOA',
        'SUV',
        1460,
        15,
        21900
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        2,
        '西部',
        '西安',
        '2019-05-31',
        '大众',
        '途锐PHEV',
        'SUV',
        497,
        61,
        30317
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        3,
        '华东',
        '上海',
        '2019-05-31',
        '宝马',
        '宝马2系多功能旅行车',
        'MPV',
        143,
        19,
        2717
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        4,
        '华北',
        '石家庄',
        '2019-05-31',
        '宝马',
        '宝马2系多功能旅行车',
        'MPV',
        79,
        19,
        1501
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        5,
        '华北',
        '北京',
        '2019-06-30',
        '大众',
        '辉昂',
        '轿车',
        337,
        35,
        11795
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        6,
        '华中',
        '岳阳',
        '2019-06-30',
        '别克',
        '君越',
        '轿车',
        492,
        21,
        10332
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        7,
        '西部',
        '甘肃',
        '2019-06-30',
        '大众',
        '辉昂',
        '轿车',
        499,
        35,
        17465
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        8,
        '华南',
        '广州',
        '2019-06-30',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        35,
        17,
        595
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        9,
        '华北',
        '石家庄',
        '2019-06-30',
        '大众',
        '威然',
        'MPV',
        43,
        35,
        1505
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        10,
        '西部',
        '西安',
        '2019-07-31',
        '别克',
        '威朗',
        '轿车',
        477,
        12,
        5724
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        11,
        '西部',
        '甘孜',
        '2019-07-31',
        '别克',
        '威朗',
        '轿车',
        450,
        12,
        5400
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        12,
        '华中',
        '岳阳',
        '2019-07-31',
        '大众',
        '途观L PHEV',
        'SUV',
        313,
        25,
        7825
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        13,
        '华北',
        '北京',
        '2019-07-31',
        '别克',
        '昂科旗',
        'SUV',
        265,
        27,
        7155
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        14,
        '华北',
        '北京',
        '2019-07-31',
        '大众',
        '途安L',
        'MPV',
        399,
        15,
        5985
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        15,
        '西部',
        '重庆',
        '2019-07-31',
        '别克',
        '凯越',
        '轿车',
        375,
        6,
        2250
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        16,
        '华南',
        '广州',
        '2019-08-31',
        '别克',
        '威朗',
        '轿车',
        173,
        12,
        2076
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        17,
        '华南',
        '广州',
        '2019-08-31',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        482,
        18,
        8676
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        18,
        '西部',
        '甘孜',
        '2019-08-31',
        '丰田',
        '威尔法',
        'MPV',
        94,
        86,
        8084
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        19,
        '华中',
        '十堰',
        '2019-08-31',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        47,
        17,
        799
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        20,
        '西部',
        '甘孜',
        '2019-08-31',
        '丰田',
        '威驰',
        '轿车',
        115,
        7,
        805
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        21,
        '华中',
        '长沙',
        '2019-08-31',
        '比亚迪',
        '秦PLUS DM-i',
        '轿车',
        400,
        12,
        4800
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        22,
        '华南',
        '南宁',
        '2019-08-31',
        '宝马',
        '宝马3系',
        '轿车',
        180,
        32,
        5760
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        23,
        '华北',
        '北京',
        '2019-08-31',
        '丰田',
        '威驰',
        '轿车',
        450,
        7,
        3150
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        24,
        '华南',
        '佛山',
        '2019-09-30',
        '比亚迪',
        '汉EV',
        '轿车',
        183,
        24,
        4392
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        25,
        '华东',
        '上海',
        '2019-09-30',
        '别克',
        '别克GL6',
        'MPV',
        337,
        14,
        4550
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        26,
        '华北',
        '哈尔滨',
        '2019-09-30',
        '丰田',
        '亦泽IZOA',
        'SUV',
        162,
        15,
        2430
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        27,
        '华东',
        '上海',
        '2019-09-30',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        213,
        18,
        3834
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        28,
        '华东',
        '上海',
        '2019-10-31',
        '别克',
        '君越',
        '轿车',
        336,
        21,
        7056
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        29,
        '华北',
        '哈尔滨',
        '2019-10-31',
        '丰田',
        'RAV4荣放',
        'SUV',
        129,
        21,
        2709
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        30,
        '华南',
        '南充',
        '2019-10-31',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        67,
        18,
        1206
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        31,
        '华南',
        '南宁',
        '2019-10-31',
        '大众',
        '辉昂',
        '轿车',
        243,
        35,
        8505
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        32,
        '华东',
        '上海',
        '2019-10-31',
        '别克',
        '威朗',
        '轿车',
        457,
        12,
        5484
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        33,
        '西部',
        '西安',
        '2019-11-30',
        '比亚迪',
        '秦PLUS DM-i',
        '轿车',
        425,
        12,
        5100
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        34,
        '华南',
        '广州',
        '2019-11-30',
        '丰田',
        '亦泽IZOA',
        'SUV',
        330,
        15,
        4950
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        35,
        '华东',
        '上海',
        '2019-11-30',
        '丰田',
        '威驰',
        '轿车',
        217,
        7,
        1519
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        36,
        '华南',
        '深圳',
        '2019-11-30',
        '别克',
        '君越',
        '轿车',
        11,
        21,
        231
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        37,
        '华北',
        '北京',
        '2019-11-30',
        '大众',
        '辉昂',
        '轿车',
        164,
        35,
        5740
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        38,
        '华中',
        '岳阳',
        '2019-11-30',
        '比亚迪',
        '宋PLUS DM-i',
        'SUV',
        369,
        15,
        5535
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        39,
        '华北',
        '承德',
        '2019-11-30',
        '大众',
        '辉昂',
        '轿车',
        308,
        35,
        10780
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        40,
        '华南',
        '佛山',
        '2019-12-31',
        '比亚迪',
        '汉EV',
        '轿车',
        430,
        24,
        10320
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        41,
        '华北',
        '石家庄',
        '2019-12-31',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        358,
        18,
        6444
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        42,
        '西部',
        '西安',
        '2019-12-31',
        '比亚迪',
        '宋MAX DM',
        'MPV',
        35,
        18,
        630
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        43,
        '华中',
        '武汉',
        '2019-12-31',
        '丰田',
        '艾尔法',
        'MPV',
        329,
        83,
        27307
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        44,
        '华北',
        '北京',
        '2019-12-31',
        '丰田',
        '威驰',
        '轿车',
        49,
        7,
        343
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        45,
        '华东',
        '上海',
        '2019-12-31',
        '宝马',
        '宝马X1',
        'SUV',
        214,
        23,
        4922
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        46,
        '华北',
        '北京',
        '2019-12-31',
        '别克',
        '威朗',
        '轿车',
        140,
        12,
        1680
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        47,
        '华南',
        '广州',
        '2019-12-31',
        '别克',
        '威朗',
        '轿车',
        319,
        12,
        3828
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        48,
        '华南',
        '广州',
        '2020-01-31',
        '比亚迪',
        '宋MAX DM',
        'MPV',
        235,
        18,
        4230
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        49,
        '华东',
        '上海',
        '2020-01-31',
        '宝马',
        '宝马2系多功能旅行车',
        'MPV',
        35,
        19,
        665
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        50,
        '华南',
        '广州',
        '2020-01-31',
        '大众',
        '朗逸',
        '轿车',
        265,
        10,
        2650
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        51,
        '华中',
        '长沙',
        '2020-01-31',
        '丰田',
        '亦泽IZOA',
        'SUV',
        311,
        15,
        4665
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        52,
        '华东',
        '上海',
        '2020-01-31',
        '丰田',
        '艾尔法',
        'MPV',
        182,
        83,
        15106
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        53,
        '西部',
        '重庆',
        '2020-02-29',
        '大众',
        '辉昂',
        '轿车',
        301,
        35,
        10535
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        54,
        '华东',
        '上海',
        '2020-02-29',
        '大众',
        '途铠',
        'SUV',
        473,
        11,
        5203
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        55,
        '华南',
        '深圳',
        '2020-02-29',
        '比亚迪',
        '汉DM',
        '轿车',
        437,
        22,
        9614
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        56,
        '华东',
        '杭州',
        '2020-02-29',
        '大众',
        '威然',
        'MPV',
        124,
        35,
        4340
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        57,
        '华南',
        '深圳',
        '2020-03-31',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        50,
        17,
        850
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        58,
        '华北',
        '石家庄',
        '2020-03-31',
        '别克',
        '别克GL8',
        'MPV',
        227,
        40,
        9080
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        59,
        '西部',
        '重庆',
        '2020-03-31',
        '丰田',
        '艾尔法',
        'MPV',
        63,
        83,
        5229
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        60,
        '华北',
        '承德',
        '2020-03-31',
        '大众',
        '朗逸',
        '轿车',
        256,
        10,
        2560
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        61,
        '华南',
        '深圳',
        '2020-04-30',
        '比亚迪',
        '比亚迪D1',
        'MPV',
        89,
        15,
        1335
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        62,
        '华北',
        '哈尔滨',
        '2020-04-30',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        207,
        17,
        3519
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        63,
        '华北',
        '北京',
        '2020-04-30',
        '别克',
        '别克GL6',
        'MPV',
        28,
        14,
        378
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        64,
        '华北',
        '北京',
        '2020-04-30',
        '比亚迪',
        '汉EV',
        '轿车',
        103,
        24,
        2472
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        65,
        '西部',
        '甘肃',
        '2020-04-30',
        '比亚迪',
        '宋PLUS DM-i',
        'SUV',
        98,
        15,
        1470
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        66,
        '华北',
        '北京',
        '2020-04-30',
        '别克',
        '威朗',
        '轿车',
        379,
        12,
        4548
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        67,
        '华北',
        '北京',
        '2020-04-30',
        '宝马',
        '宝马X1',
        'SUV',
        352,
        23,
        8096
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        68,
        '华中',
        '武汉',
        '2020-05-31',
        '宝马',
        '宝马5系',
        '轿车',
        442,
        46,
        20332
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        69,
        '华东',
        '苏州',
        '2020-05-31',
        '别克',
        '威朗',
        '轿车',
        132,
        12,
        1584
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        70,
        '华南',
        '深圳',
        '2020-05-31',
        '丰田',
        '威驰',
        '轿车',
        96,
        7,
        672
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        71,
        '西部',
        '西安',
        '2020-05-31',
        '大众',
        '途铠',
        'SUV',
        76,
        11,
        836
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        72,
        '华南',
        '深圳',
        '2020-05-31',
        '比亚迪',
        '汉EV',
        '轿车',
        315,
        24,
        7560
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        73,
        '华东',
        '合肥',
        '2020-06-30',
        '别克',
        '昂科威',
        'SUV',
        374,
        17,
        6358
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        74,
        '西部',
        '成都',
        '2020-06-30',
        '宝马',
        '宝马X1',
        'SUV',
        401,
        23,
        9223
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        75,
        '华南',
        '广州',
        '2020-06-30',
        '别克',
        '别克GL8',
        'MPV',
        147,
        40,
        5880
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        76,
        '华北',
        '北京',
        '2020-06-30',
        '别克',
        '君越',
        '轿车',
        130,
        21,
        2730
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        77,
        '华中',
        '长沙',
        '2020-07-31',
        '丰田',
        '亦泽IZOA',
        'SUV',
        465,
        15,
        6975
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        78,
        '华南',
        '南充',
        '2020-07-31',
        '别克',
        '君越',
        '轿车',
        78,
        21,
        1638
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        79,
        '华南',
        '南充',
        '2020-07-31',
        '宝马',
        '宝马3系',
        '轿车',
        34,
        32,
        1088
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        80,
        '华南',
        '深圳',
        '2020-07-31',
        '丰田',
        '威尔法',
        'MPV',
        471,
        86,
        40506
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        81,
        '华东',
        '上海',
        '2020-07-31',
        '丰田',
        '艾尔法',
        'MPV',
        392,
        83,
        32536
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        82,
        '华北',
        '北京',
        '2020-07-31',
        '丰田',
        'RAV4荣放',
        'SUV',
        289,
        21,
        6069
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        83,
        '华东',
        '上海',
        '2020-08-31',
        '比亚迪',
        '唐DM',
        'SUV',
        277,
        24,
        6648
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        84,
        '华南',
        '深圳',
        '2020-08-31',
        '大众',
        '辉昂',
        '轿车',
        347,
        35,
        12145
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        85,
        '华南',
        '广州',
        '2020-09-30',
        '宝马',
        '宝马X3',
        'SUV',
        376,
        41,
        15416
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        86,
        '华中',
        '武汉',
        '2020-09-30',
        '别克',
        '君越',
        '轿车',
        75,
        21,
        1575
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        87,
        '华南',
        '佛山',
        '2020-09-30',
        '宝马',
        '宝马3系',
        '轿车',
        247,
        32,
        7904
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        88,
        '华东',
        '苏州',
        '2020-09-30',
        '比亚迪',
        '汉DM',
        '轿车',
        210,
        22,
        4620
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        89,
        '华南',
        '佛山',
        '2020-09-30',
        '丰田',
        '艾尔法',
        'MPV',
        133,
        83,
        11039
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        90,
        '华南',
        '南宁',
        '2020-09-30',
        '大众',
        '辉昂',
        '轿车',
        98,
        35,
        3430
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        91,
        '华中',
        '长沙',
        '2020-09-30',
        '大众',
        'e-Golf',
        '轿车',
        308,
        24,
        7392
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        92,
        '西部',
        '重庆',
        '2020-10-31',
        '丰田',
        '威尔法',
        'MPV',
        155,
        86,
        13330
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        93,
        '西部',
        '西安',
        '2020-10-31',
        '比亚迪',
        '汉EV',
        '轿车',
        377,
        24,
        9048
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        94,
        '华南',
        '广州',
        '2020-10-31',
        '大众',
        '辉昂',
        '轿车',
        493,
        35,
        17255
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        95,
        '华南',
        '南充',
        '2020-10-31',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        286,
        18,
        5148
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        96,
        '西部',
        '重庆',
        '2020-10-31',
        '大众',
        '朗逸',
        '轿车',
        389,
        10,
        3890
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        97,
        '华北',
        '北京',
        '2020-11-30',
        '宝马',
        '宝马2系多功能旅行车',
        'MPV',
        73,
        19,
        1387
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        98,
        '华南',
        '广州',
        '2020-11-30',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        314,
        18,
        5652
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        99,
        '华中',
        '长沙',
        '2020-11-30',
        '丰田',
        '艾尔法',
        'MPV',
        129,
        83,
        10707
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        100,
        '华南',
        '深圳',
        '2020-11-30',
        '大众',
        'e-Golf',
        '轿车',
        190,
        24,
        4560
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        101,
        '华中',
        '十堰',
        '2020-12-31',
        '丰田',
        '艾尔法',
        'MPV',
        39,
        83,
        3237
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        102,
        '西部',
        '西安',
        '2020-12-31',
        '丰田',
        '艾尔法',
        'MPV',
        475,
        83,
        39425
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        103,
        '华东',
        '上海',
        '2020-12-31',
        '大众',
        'e-Golf',
        '轿车',
        133,
        24,
        3192
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        104,
        '西部',
        '西安',
        '2020-12-31',
        '比亚迪',
        '汉EV',
        '轿车',
        425,
        24,
        10200
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        105,
        '华北',
        '天津',
        '2020-12-31',
        '大众',
        '辉昂',
        '轿车',
        94,
        35,
        3290
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        106,
        '华东',
        '合肥',
        '2021-01-31',
        '丰田',
        '威驰',
        '轿车',
        171,
        7,
        1197
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        107,
        '华北',
        '北京',
        '2021-01-31',
        '别克',
        '别克GL8',
        'MPV',
        240,
        40,
        9600
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        108,
        '华东',
        '上海',
        '2021-01-31',
        '宝马',
        '宝马5系',
        '轿车',
        460,
        46,
        21160
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        109,
        '华东',
        '上海',
        '2021-01-31',
        '丰田',
        '亦泽IZOA',
        'SUV',
        89,
        15,
        1335
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        110,
        '华东',
        '苏州',
        '2021-01-31',
        '比亚迪',
        '宋PLUS DM-i',
        'SUV',
        403,
        15,
        6045
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        111,
        '华东',
        '杭州',
        '2021-01-31',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        251,
        18,
        4518
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        112,
        '华南',
        '南充',
        '2021-01-31',
        '比亚迪',
        '唐DM',
        'SUV',
        266,
        24,
        6384
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        113,
        '华北',
        '北京',
        '2021-02-28',
        '宝马',
        '宝马5系',
        '轿车',
        280,
        46,
        12880
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        114,
        '华中',
        '十堰',
        '2021-02-28',
        '大众',
        'e-Golf',
        '轿车',
        413,
        24,
        9912
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        115,
        '华中',
        '十堰',
        '2021-02-28',
        '丰田',
        '威驰',
        '轿车',
        164,
        7,
        1148
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        116,
        '华南',
        '广州',
        '2021-02-28',
        '大众',
        'e-Golf',
        '轿车',
        423,
        24,
        10152
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        117,
        '华东',
        '杭州',
        '2021-03-31',
        '比亚迪',
        '唐DM',
        'SUV',
        46,
        24,
        1104
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        118,
        '华南',
        '南充',
        '2021-03-31',
        '比亚迪',
        '汉DM',
        '轿车',
        202,
        22,
        4444
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        119,
        '华南',
        '广州',
        '2021-03-31',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        497,
        17,
        8449
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        120,
        '华南',
        '深圳',
        '2021-03-31',
        '宝马',
        '宝马X1',
        'SUV',
        95,
        23,
        2185
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        121,
        '华中',
        '岳阳',
        '2021-04-30',
        '丰田',
        '卡罗拉双擎E+',
        '轿车',
        142,
        18,
        2556
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        122,
        '华中',
        '武汉',
        '2021-04-30',
        '别克',
        '君越',
        '轿车',
        372,
        21,
        7812
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        123,
        '华北',
        '天津',
        '2021-04-30',
        '宝马',
        '宝马1系',
        '轿车',
        183,
        18,
        3294
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        124,
        '华东',
        '苏州',
        '2021-04-30',
        '丰田',
        '威驰',
        '轿车',
        216,
        7,
        1512
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        125,
        '华中',
        '十堰',
        '2020-10-31',
        '别克',
        '别克GL8',
        'MPV',
        242,
        40,
        9680
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        126,
        '华中',
        '十堰',
        '2020-11-30',
        '宝马',
        '宝马5系',
        '轿车',
        353,
        46,
        16238
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        127,
        '华东',
        '苏州',
        '2020-11-30',
        '宝马',
        '宝马X3',
        'SUV',
        408,
        41,
        16728
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        128,
        '华中',
        '岳阳',
        '2020-11-30',
        '别克',
        '凯越',
        '轿车',
        221,
        6,
        1326
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        129,
        '西部',
        '重庆',
        '2020-11-30',
        '丰田',
        '亦泽IZOA',
        'SUV',
        431,
        15,
        6465
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        130,
        '华东',
        '上海',
        '2020-12-31',
        '大众',
        '朗逸',
        '轿车',
        210,
        10,
        2100
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        131,
        '华南',
        '广州',
        '2020-12-31',
        '比亚迪',
        '汉DM',
        '轿车',
        236,
        22,
        5192
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        132,
        '华南',
        '深圳',
        '2020-12-31',
        '别克',
        '威朗',
        '轿车',
        234,
        12,
        2808
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        133,
        '西部',
        '甘肃',
        '2020-12-31',
        '宝马',
        '宝马X1',
        'SUV',
        270,
        23,
        6210
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        134,
        '华北',
        '北京',
        '2020-12-31',
        '别克',
        '威朗',
        '轿车',
        345,
        12,
        4140
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        135,
        '华南',
        '南宁',
        '2021-01-31',
        '别克',
        '昂科威',
        'SUV',
        43,
        17,
        731
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        136,
        '华南',
        '南充',
        '2021-01-31',
        '丰田',
        '亦泽IZOA',
        'SUV',
        24,
        15,
        360
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        137,
        '华北',
        '北京',
        '2021-01-31',
        '别克',
        '别克GL6',
        'MPV',
        409,
        14,
        5522
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        138,
        '华南',
        '深圳',
        '2021-01-31',
        '宝马',
        '宝马5系',
        '轿车',
        25,
        46,
        1150
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        139,
        '华南',
        '南充',
        '2021-01-31',
        '丰田',
        'RAV4荣放',
        'SUV',
        81,
        21,
        1701
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        140,
        '西部',
        '重庆',
        '2021-01-31',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        208,
        17,
        3536
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        141,
        '华北',
        '天津',
        '2021-01-31',
        '丰田',
        '雷凌双擎E+',
        '轿车',
        195,
        17,
        3315
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        142,
        '华北',
        '石家庄',
        '2021-02-28',
        '比亚迪',
        '宋MAX DM',
        'MPV',
        42,
        18,
        756
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        143,
        '西部',
        '甘肃',
        '2021-02-28',
        '大众',
        '途安L',
        'MPV',
        442,
        15,
        6630
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        144,
        '华北',
        '北京',
        '2021-02-28',
        '宝马',
        '宝马X1',
        'SUV',
        235,
        23,
        5405
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        145,
        '华南',
        '南充',
        '2021-02-28',
        '别克',
        '昂科威',
        'SUV',
        484,
        17,
        8228
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        146,
        '西部',
        '重庆',
        '2021-03-31',
        '宝马',
        '宝马5系',
        '轿车',
        94,
        46,
        4324
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        147,
        '西部',
        '重庆',
        '2021-03-31',
        '比亚迪',
        '宋PLUS DM-i',
        'SUV',
        78,
        15,
        1170
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        148,
        '华南',
        '南宁',
        '2021-03-31',
        '丰田',
        '威驰',
        '轿车',
        84,
        7,
        588
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        149,
        '华北',
        '北京',
        '2021-03-31',
        '大众',
        '辉昂',
        '轿车',
        159,
        35,
        5565
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        150,
        '华北',
        '哈尔滨',
        '2021-04-30',
        '大众',
        '辉昂',
        '轿车',
        402,
        35,
        14070
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        151,
        '华中',
        '岳阳',
        '2021-04-30',
        '丰田',
        '艾尔法',
        'MPV',
        158,
        83,
        13114
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        152,
        '华东',
        '杭州',
        '2021-04-30',
        '比亚迪',
        '汉DM',
        '轿车',
        65,
        22,
        1430
    );

INSERT INTO
    `car_sales` (
        `序号`,
        `地区`,
        `城市`,
        `销售日期`,
        `品牌`,
        `车系`,
        `车型`,
        `销量`,
        `价格(万)`,
        `销售额(万)`
    )
VALUES (
        153,
        '西部',
        '成都',
        '2021-04-30',
        '大众',
        'e-Golf',
        '轿车',
        96,
        24,
        2304
    );

COMMIT;

-- ----------------------------
-- Table structure for customers
-- ----------------------------
DROP TABLE IF EXISTS `customers`;

CREATE TABLE `customers` (
    `Id` int DEFAULT NULL,
    `Name` varchar(255) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of customers
-- ----------------------------
BEGIN;

INSERT INTO `customers` (`Id`, `Name`) VALUES (1, 'Joe');

INSERT INTO `customers` (`Id`, `Name`) VALUES (2, 'Henry');

INSERT INTO `customers` (`Id`, `Name`) VALUES (3, 'Sam');

INSERT INTO `customers` (`Id`, `Name`) VALUES (4, 'Max');

COMMIT;

-- ----------------------------
-- Table structure for dept
-- ----------------------------
DROP TABLE IF EXISTS `dept`;

CREATE TABLE `dept` (
    `dept_id` int NOT NULL,
    `dept_name` varchar(100) DEFAULT NULL,
    `partent_id` int DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of dept
-- ----------------------------
BEGIN;

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (1, '省行', 0);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (2, '自贸区分行', 1);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (3, '中原区分行', 1);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (10, '龙子湖支行', 2);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (11, '高新区支行', 2);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (12, '商鼎路支行', 2);

INSERT INTO
    `dept` (
        `dept_id`,
        `dept_name`,
        `partent_id`
    )
VALUES (13, '开心支行', 2);

COMMIT;

-- ----------------------------
-- Table structure for employee
-- ----------------------------
DROP TABLE IF EXISTS `employee`;

CREATE TABLE `employee` (
    `Id` int DEFAULT NULL,
    `Name` varchar(255) DEFAULT NULL,
    `Salary` int DEFAULT NULL,
    `ManagerId` int DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of employee
-- ----------------------------
BEGIN;

INSERT INTO
    `employee` (
        `Id`,
        `Name`,
        `Salary`,
        `ManagerId`
    )
VALUES (1, 'Joe', 70000, 3);

INSERT INTO
    `employee` (
        `Id`,
        `Name`,
        `Salary`,
        `ManagerId`
    )
VALUES (2, 'Henry', 80000, 4);

INSERT INTO
    `employee` (
        `Id`,
        `Name`,
        `Salary`,
        `ManagerId`
    )
VALUES (3, 'Sam', 60000, 0);

INSERT INTO
    `employee` (
        `Id`,
        `Name`,
        `Salary`,
        `ManagerId`
    )
VALUES (4, 'Max', 90000, 0);

COMMIT;

-- ----------------------------
-- Table structure for form
-- ----------------------------
DROP TABLE IF EXISTS `form`;

CREATE TABLE `form` (
    `form_id` int DEFAULT NULL,
    `form_name` varchar(100) DEFAULT NULL,
    `status` varchar(1) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of form
-- ----------------------------
BEGIN;

INSERT INTO
    `form` (
        `form_id`,
        `form_name`,
        `status`
    )
VALUES (1, '登记簿', '0');

INSERT INTO
    `form` (
        `form_id`,
        `form_name`,
        `status`
    )
VALUES (2, '请假表', '0');

INSERT INTO
    `form` (
        `form_id`,
        `form_name`,
        `status`
    )
VALUES (3, '外出表', '1');

COMMIT;

-- ----------------------------
-- Table structure for height_grades
-- ----------------------------
DROP TABLE IF EXISTS `height_grades`;

CREATE TABLE `height_grades` (
    `height_level` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '身高等级',
    `height_lowest` float(3, 2) NOT NULL COMMENT '该等级范围中的最低身高',
    `height_highest` float(3, 2) NOT NULL COMMENT '该等级范围中的最高身高'
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of height_grades
-- ----------------------------
BEGIN;

INSERT INTO
    `height_grades` (
        `height_level`,
        `height_lowest`,
        `height_highest`
    )
VALUES ('A', 2.00, 2.50);

INSERT INTO
    `height_grades` (
        `height_level`,
        `height_lowest`,
        `height_highest`
    )
VALUES ('B', 1.90, 1.99);

INSERT INTO
    `height_grades` (
        `height_level`,
        `height_lowest`,
        `height_highest`
    )
VALUES ('C', 1.80, 1.89);

INSERT INTO
    `height_grades` (
        `height_level`,
        `height_lowest`,
        `height_highest`
    )
VALUES ('D', 1.60, 1.79);

COMMIT;

-- ----------------------------
-- Table structure for hero_score
-- ----------------------------
DROP TABLE IF EXISTS `hero_score`;

CREATE TABLE `hero_score` (
    `id` int NOT NULL AUTO_INCREMENT,
    `score` int NOT NULL DEFAULT '0',
    `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
    PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of hero_score
-- ----------------------------
BEGIN;

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (1, 80, '张飞');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (2, 95, '关羽');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (3, 92, '刘备');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (4, 92, '曹操');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (5, 89, '典韦');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (6, 87, '貂蝉');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (7, 99, '诸葛亮');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (8, 93, '赵云');

INSERT INTO
    `hero_score` (`id`, `score`, `name`)
VALUES (9, 96, '关羽');

COMMIT;

-- ----------------------------
-- Table structure for heros
-- ----------------------------
DROP TABLE IF EXISTS `heros`;

CREATE TABLE `heros` (
    `id` int NOT NULL AUTO_INCREMENT,
    `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
    `hp_max` float DEFAULT NULL,
    `hp_growth` float DEFAULT NULL,
    `hp_start` float DEFAULT NULL,
    `mp_max` float DEFAULT NULL,
    `mp_growth` float DEFAULT NULL,
    `mp_start` float DEFAULT NULL,
    `attack_max` float DEFAULT NULL,
    `attack_growth` float DEFAULT NULL,
    `attack_start` float DEFAULT NULL,
    `defense_max` float DEFAULT NULL,
    `defense_growth` float DEFAULT NULL,
    `defense_start` float DEFAULT NULL,
    `hp_5s_max` float DEFAULT NULL,
    `hp_5s_growth` float DEFAULT NULL,
    `hp_5s_start` float DEFAULT NULL,
    `mp_5s_max` float DEFAULT NULL,
    `mp_5s_growth` float DEFAULT NULL,
    `mp_5s_start` float DEFAULT NULL,
    `attack_speed_max` float DEFAULT NULL,
    `attack_range` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
    `role_main` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
    `role_assist` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
    `birthdate` date DEFAULT NULL,
    PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10069 DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of heros
-- ----------------------------
BEGIN;

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10000,
        '夏侯惇',
        7350,
        288.8,
        3307,
        1746,
        94,
        430,
        321,
        11.57,
        159,
        397,
        21.14,
        101,
        98,
        3.357,
        51,
        37,
        1.571,
        15,
        0,
        '近战',
        '坦克',
        '战士',
        '2016-07-19'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10001,
        '钟无艳',
        7000,
        275,
        3150,
        1760,
        95,
        430,
        318,
        11,
        164,
        409,
        22.07,
        100,
        92,
        3.143,
        48,
        37,
        1.571,
        15,
        0,
        '近战',
        '战士',
        '坦克',
        '2021-05-01'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10002,
        '钟',
        8341,
        329.4,
        3450,
        100,
        0,
        100,
        301,
        10.57,
        153,
        504,
        27.07,
        125,
        115,
        4.143,
        57,
        5,
        0,
        5,
        0,
        '近战',
        '坦克',
        '辅助',
        '2012-05-04'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10003,
        '牛魔',
        8476,
        352.8,
        3537,
        1926,
        104,
        470,
        273,
        8.357,
        156,
        394,
        20.36,
        109,
        117,
        4.214,
        58,
        42,
        1.786,
        17,
        0,
        '近战',
        '坦克',
        '辅助',
        '2015-11-24'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10004,
        '吕布',
        7344,
        270,
        3564,
        0,
        0,
        0,
        343,
        12.36,
        170,
        390,
        20.79,
        99,
        97,
        3.071,
        54,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        '坦克',
        '2015-12-22'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10005,
        '亚瑟',
        8050,
        316.3,
        3622,
        0,
        0,
        0,
        346,
        13,
        164,
        400,
        21.57,
        98,
        106,
        3.643,
        55,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        '坦克',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10006,
        '芈月',
        6164,
        281.5,
        3105,
        100,
        0,
        100,
        289,
        9.786,
        152,
        361,
        19.5,
        88,
        77,
        2.357,
        44,
        0,
        0,
        0,
        0,
        '远程',
        '法师',
        '坦克',
        '2015-12-08'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10007,
        '程咬金',
        8611,
        369.6,
        3437,
        0,
        0,
        0,
        316,
        11.07,
        161,
        504,
        27.07,
        125,
        119,
        4.429,
        57,
        0,
        0,
        0,
        0,
        '近战',
        '坦克',
        '战士',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10008,
        '廉颇',
        9328,
        412.1,
        3558,
        1708,
        92,
        420,
        286,
        8.786,
        NULL,
        514,
        27.29,
        132,
        128,
        4.929,
        59,
        36,
        1.5,
        15,
        0,
        '近战',
        '坦克',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10009,
        '东皇太一',
        7669,
        319.1,
        3201,
        1926,
        104,
        470,
        286,
        8.786,
        163,
        360,
        18.64,
        99,
        106,
        3.786,
        53,
        42,
        1.786,
        17,
        0,
        '近战',
        '坦克',
        NULL,
        '2017-03-30'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10010,
        '庄周',
        8149,
        345.6,
        3311,
        1694,
        91,
        420,
        297,
        9.071,
        170,
        497,
        24.79,
        150,
        113,
        4.143,
        55,
        36,
        1.5,
        15,
        0,
        '近战',
        '辅助',
        '坦克',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10011,
        '太乙真人',
        6835,
        242.3,
        3443,
        1680,
        90,
        420,
        284,
        9.286,
        154,
        396,
        21.57,
        94,
        86,
        2.643,
        49,
        35,
        1.429,
        15,
        0,
        '近战',
        '辅助',
        '坦克',
        '2016-11-24'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10012,
        '白起',
        8638,
        366.3,
        3510,
        1666,
        89,
        420,
        288,
        9.286,
        158,
        430,
        22.14,
        120,
        119,
        4.357,
        58,
        34,
        1.429,
        14,
        0,
        '近战',
        '坦克',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10013,
        '雅典娜',
        6264,
        243,
        2862,
        1732,
        93,
        430,
        327,
        11.79,
        162,
        418,
        22.29,
        106,
        83,
        2.786,
        44,
        36,
        1.5,
        15,
        0,
        '近战',
        '战士',
        '坦克',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10014,
        '刘邦',
        8073,
        336,
        3369,
        1940,
        105,
        470,
        302,
        10.29,
        158,
        504,
        27.07,
        125,
        117,
        4.214,
        58,
        42,
        1.786,
        17,
        0,
        '近战',
        '坦克',
        '辅助',
        '2016-04-26'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10015,
        '刘禅',
        8581,
        372.6,
        3364,
        1694,
        91,
        420,
        295,
        8.357,
        178,
        459,
        22.86,
        139,
        118,
        4.429,
        56,
        36,
        1.5,
        15,
        0,
        '近战',
        '坦克',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10016,
        '墨子',
        7176,
        292.4,
        3083,
        1722,
        93,
        420,
        328,
        10.5,
        181,
        475,
        26.64,
        102,
        100,
        3.5,
        51,
        37,
        1.571,
        15,
        0,
        '近战',
        '法师',
        '坦克',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10017,
        '项羽',
        8057,
        380.1,
        3535,
        1694,
        91,
        420,
        306,
        10.64,
        157,
        494,
        26.5,
        123,
        121,
        4.5,
        58,
        36,
        1.5,
        15,
        0,
        '近战',
        '坦克',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10018,
        '关羽',
        7107,
        270.4,
        3322,
        10,
        0,
        10,
        343,
        12.36,
        170,
        386,
        20.36,
        101,
        94,
        3.071,
        51,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        '坦克',
        '2016-06-28'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10019,
        '后羿',
        5986,
        200.3,
        3182,
        1784,
        96,
        440,
        396,
        16.79,
        161,
        336,
        17.86,
        86,
        71,
        2.143,
        41,
        38,
        1.571,
        16,
        0,
        '远程',
        '射手',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10020,
        '马可波罗',
        5584,
        181.6,
        3041,
        200,
        0,
        200,
        362,
        13.36,
        175,
        344,
        18.07,
        91,
        75,
        2.071,
        46,
        50,
        0,
        50,
        0,
        '远程',
        '射手',
        NULL,
        '2016-08-23'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10021,
        '鲁班七号',
        5989,
        184.9,
        3401,
        1756,
        94,
        440,
        400,
        16.14,
        174,
        323,
        16.79,
        88,
        69,
        1.929,
        42,
        36,
        1.5,
        15,
        0,
        '远程',
        '射手',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10022,
        '李元芳',
        5725,
        194.1,
        3007,
        1770,
        95,
        440,
        396,
        16.79,
        161,
        340,
        18.07,
        87,
        66,
        2.071,
        37,
        37,
        1.571,
        15,
        0,
        '远程',
        '射手',
        NULL,
        '2016-04-12'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10023,
        '孙尚香',
        6014,
        198.5,
        3235,
        1756,
        94,
        440,
        411,
        17.07,
        172,
        346,
        18.36,
        89,
        69,
        2.071,
        40,
        36,
        1.5,
        15,
        0,
        '远程',
        '射手',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10024,
        '黄忠',
        5898,
        194.6,
        3173,
        1784,
        96,
        440,
        403,
        16.5,
        172,
        319,
        16.29,
        91,
        68,
        2.071,
        39,
        38,
        1.571,
        16,
        0,
        '远程',
        '射手',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10025,
        '狄仁杰',
        5710,
        176.3,
        3242,
        1770,
        95,
        440,
        376,
        14.79,
        169,
        338,
        17.36,
        95,
        66,
        1.857,
        40,
        37,
        1.571,
        15,
        0,
        '远程',
        '射手',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10026,
        '虞姬',
        5669,
        192.3,
        2977,
        1770,
        95,
        440,
        407,
        17.29,
        165,
        329,
        17.5,
        84,
        63,
        1.929,
        36,
        38,
        1.571,
        16,
        0,
        '远程',
        '射手',
        NULL,
        '2016-05-24'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10027,
        '成吉思汗',
        5799,
        198,
        3027,
        1742,
        93,
        440,
        394,
        15,
        184,
        329,
        16.79,
        94,
        66,
        2.071,
        37,
        36,
        1.5,
        15,
        0,
        '远程',
        '射手',
        NULL,
        '2016-09-27'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10028,
        '嬴政',
        5471,
        167.6,
        3125,
        1946,
        104,
        490,
        309,
        10.86,
        157,
        295,
        14.57,
        91,
        70,
        1.857,
        44,
        41,
        1.714,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10029,
        '武则天',
        5037,
        155.5,
        2860,
        1988,
        107,
        490,
        297,
        8.857,
        173,
        348,
        18.07,
        95,
        64,
        1.714,
        40,
        43,
        1.786,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10030,
        '露娜',
        6612,
        256.5,
        3021,
        1836,
        99,
        450,
        335,
        12.29,
        163,
        375,
        19.5,
        102,
        99,
        3.357,
        52,
        39,
        1.643,
        16,
        0,
        '近战',
        '战士',
        '法师',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10031,
        '甄姬',
        5584,
        181.6,
        3041,
        2002,
        108,
        490,
        296,
        9.357,
        165,
        330,
        17.36,
        87,
        71,
        2,
        43,
        44,
        1.857,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10032,
        '妲己',
        5824,
        185.4,
        3229,
        2016,
        109,
        490,
        293,
        8.786,
        170,
        326,
        17.14,
        86,
        74,
        2,
        46,
        44,
        1.857,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10033,
        '干将莫邪',
        5583,
        171,
        3189,
        1946,
        104,
        490,
        292,
        9.5,
        159,
        323,
        16.5,
        92,
        71,
        1.857,
        45,
        41,
        1.714,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2017-05-22'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10034,
        '姜子牙',
        5399,
        174.4,
        2958,
        2002,
        108,
        490,
        317,
        10.64,
        168,
        342,
        16.86,
        106,
        69,
        1.929,
        42,
        44,
        1.857,
        18,
        0,
        '远程',
        '法师',
        '辅助',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10035,
        '王昭君',
        5429,
        167.6,
        3083,
        1960,
        105,
        490,
        296,
        9.357,
        165,
        305,
        15.29,
        91,
        70,
        1.857,
        44,
        41,
        1.714,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10036,
        '诸葛亮',
        5655,
        180,
        3135,
        1988,
        107,
        490,
        287,
        9.357,
        156,
        330,
        17.36,
        87,
        72,
        2,
        44,
        43,
        1.786,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10037,
        '不知火舞',
        6014,
        198.5,
        3235,
        200,
        0,
        200,
        293,
        8.786,
        170,
        336,
        17.64,
        89,
        76,
        2.143,
        46,
        50,
        0,
        50,
        0,
        '近战',
        '法师',
        '刺客',
        '2016-05-12'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10038,
        '貂蝉',
        5611,
        185.1,
        3019,
        1960,
        105,
        490,
        287,
        8.571,
        167,
        330,
        17.36,
        87,
        71,
        2,
        43,
        41,
        1.714,
        17,
        0,
        '近战',
        '法师',
        '刺客',
        '2015-12-15'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10039,
        '孙膑',
        6811,
        257.4,
        3208,
        1926,
        104,
        470,
        328,
        10.86,
        176,
        413,
        22.5,
        98,
        85,
        2.857,
        45,
        42,
        1.786,
        17,
        0,
        '远程',
        '辅助',
        '法师',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10040,
        '安琪拉',
        5994,
        190.8,
        3323,
        1960,
        105,
        490,
        293,
        8.786,
        170,
        315,
        16.57,
        83,
        76,
        2.071,
        47,
        41,
        1.714,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10041,
        '小乔',
        5916,
        202,
        3088,
        1988,
        107,
        490,
        263,
        7.857,
        153,
        309,
        15.29,
        95,
        75,
        2.214,
        44,
        43,
        1.786,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10042,
        '周瑜',
        5513,
        172.9,
        3093,
        1974,
        106,
        490,
        298,
        9.857,
        160,
        320,
        16.64,
        87,
        70,
        1.857,
        44,
        42,
        1.786,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2015-11-10'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10043,
        '张良',
        5799,
        198,
        3027,
        1988,
        107,
        490,
        293,
        8.786,
        170,
        320,
        16.64,
        87,
        73,
        2.143,
        43,
        43,
        1.786,
        18,
        0,
        '远程',
        '法师',
        NULL,
        '2015-10-26'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10044,
        '高渐离',
        6165,
        217.4,
        3122,
        1988,
        107,
        490,
        290,
        9.071,
        163,
        343,
        17.5,
        98,
        77,
        2.357,
        44,
        42,
        1.786,
        17,
        0,
        '远程',
        '法师',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10045,
        '扁鹊',
        6703,
        249.9,
        3205,
        2016,
        109,
        490,
        309,
        10.07,
        168,
        374,
        20.5,
        87,
        83,
        2.714,
        45,
        44,
        1.857,
        18,
        0,
        '远程',
        '法师',
        '辅助',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10046,
        '钟馗',
        6280,
        204.3,
        3420,
        1988,
        107,
        490,
        278,
        8.286,
        162,
        390,
        20.79,
        99,
        91,
        2.429,
        57,
        42,
        1.786,
        17,
        0,
        '近战',
        '法师',
        '战士',
        '2016-03-24'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10047,
        '大乔',
        5399,
        174.4,
        2958,
        1926,
        104,
        470,
        305,
        9.786,
        168,
        340,
        17.64,
        93,
        69,
        1.929,
        42,
        42,
        1.786,
        17,
        0,
        '近战',
        '辅助',
        NULL,
        '2017-02-28'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10048,
        '鬼谷子',
        7107,
        270.4,
        3322,
        1808,
        97,
        450,
        297,
        9.643,
        162,
        394,
        21.57,
        92,
        89,
        3,
        47,
        38,
        1.571,
        16,
        0,
        '近战',
        '辅助',
        NULL,
        '2017-06-29'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10049,
        '蔡文姬',
        5910,
        190.9,
        3238,
        1898,
        102,
        470,
        292,
        9.5,
        159,
        350,
        18.14,
        96,
        66,
        2,
        38,
        41,
        1.714,
        17,
        0,
        '远程',
        '辅助',
        NULL,
        '2016-07-08'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10050,
        '花木兰',
        5397,
        179.4,
        2886,
        100,
        0,
        100,
        362,
        14,
        166,
        349,
        18.79,
        86,
        72,
        2,
        44,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        '刺客',
        '2016-01-01'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10051,
        '赵云',
        6732,
        247.5,
        3267,
        1760,
        95,
        430,
        380,
        14.79,
        173,
        394,
        22.14,
        84,
        89,
        2.786,
        50,
        37,
        1.571,
        15,
        0,
        '近战',
        '战士',
        '刺客',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10052,
        '橘石京',
        7000,
        275,
        3150,
        0,
        0,
        0,
        347,
        13,
        165,
        392,
        21.14,
        96,
        92,
        3.143,
        48,
        0,
        0,
        0,
        0,
        '近战',
        '刺客',
        '战士',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10053,
        '李白',
        5483,
        179.6,
        2968,
        1808,
        97,
        450,
        330,
        11.5,
        169,
        358,
        18.57,
        98,
        80,
        2.214,
        49,
        38,
        1.571,
        16,
        0,
        '近战',
        '刺客',
        '战士',
        '2016-03-01'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10054,
        '韩信',
        5655,
        190.5,
        2988,
        1704,
        91,
        430,
        386,
        15.29,
        172,
        323,
        16.5,
        92,
        75,
        2.143,
        45,
        36,
        1.5,
        15,
        0,
        '近战',
        '刺客',
        '战士',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10055,
        '杨戬',
        7420,
        291.5,
        3339,
        1694,
        91,
        420,
        325,
        11.36,
        166,
        428,
        23.57,
        98,
        98,
        3.357,
        51,
        36,
        1.5,
        15,
        0,
        '近战',
        '战士',
        NULL,
        '2016-10-11'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10056,
        '达摩',
        7140,
        280.5,
        3213,
        1694,
        91,
        420,
        355,
        13.14,
        171,
        415,
        22.86,
        95,
        98,
        3.357,
        51,
        36,
        1.5,
        15,
        0,
        '近战',
        '战士',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10057,
        '孙悟空',
        6585,
        235.1,
        3293,
        1760,
        95,
        430,
        349,
        13,
        167,
        385,
        20.79,
        94,
        87,
        2.643,
        50,
        37,
        1.571,
        15,
        0,
        '近战',
        '战士',
        '刺客',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10058,
        '刘备',
        6900,
        262.5,
        3225,
        1742,
        93,
        440,
        363,
        14.29,
        163,
        381,
        19.14,
        113,
        79,
        2.786,
        40,
        36,
        1.5,
        15,
        0,
        '远程',
        '战士',
        NULL,
        '2016-02-02'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10059,
        '曹操',
        7473,
        286.1,
        3467,
        0,
        0,
        0,
        361,
        13.36,
        174,
        371,
        19.07,
        104,
        101,
        3.357,
        54,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10060,
        '典韦',
        7516,
        291.6,
        3434,
        1774,
        96,
        430,
        345,
        12.64,
        168,
        402,
        22.36,
        89,
        99,
        3.357,
        52,
        39,
        1.643,
        16,
        0,
        '近战',
        '战士',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10061,
        '宫本武藏',
        6210,
        236.3,
        2902,
        0,
        0,
        0,
        330,
        12.36,
        157,
        391,
        20.36,
        106,
        85,
        2.714,
        47,
        0,
        0,
        0,
        0,
        '近战',
        '战士',
        NULL,
        '2015-10-30'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10062,
        '老夫子',
        7155,
        270.4,
        3370,
        5,
        0,
        5,
        329,
        11.5,
        168,
        409,
        22.07,
        100,
        94,
        3.071,
        51,
        0,
        0,
        0,
        1,
        '近战',
        '战士',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10063,
        '哪吒',
        7268,
        270.4,
        3483,
        1808,
        97,
        450,
        320,
        11.5,
        159,
        408,
        22.07,
        99,
        98,
        3.214,
        53,
        38,
        1.571,
        16,
        0,
        '近战',
        '战士',
        NULL,
        '2017-01-12'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10064,
        '阿轲',
        5968,
        192.8,
        3269,
        0,
        0,
        0,
        427,
        17.86,
        177,
        349,
        18.57,
        89,
        81,
        2.214,
        50,
        0,
        0,
        0,
        0,
        '近战',
        '刺客',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10065,
        '娜可露露',
        6205,
        211.9,
        3239,
        1808,
        97,
        450,
        385,
        15.14,
        173,
        359,
        19.5,
        86,
        79,
        2.286,
        47,
        38,
        1.571,
        16,
        0,
        '近战',
        '刺客',
        NULL,
        '2016-02-22'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10066,
        '兰陵王',
        6232,
        210,
        3292,
        1822,
        98,
        450,
        388,
        15.5,
        171,
        342,
        18.36,
        85,
        99,
        3.357,
        52,
        46,
        1.929,
        19,
        0,
        '近战',
        '刺客',
        NULL,
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10067,
        '铠',
        6700,
        237.5,
        3375,
        1784,
        96,
        440,
        328,
        10.86,
        176,
        388,
        20.07,
        107,
        81,
        2.643,
        44,
        38,
        1.571,
        16,
        0,
        '近战',
        '战士',
        '坦克',
        '2021-05-18'
    );

INSERT INTO
    `heros` (
        `id`,
        `name`,
        `hp_max`,
        `hp_growth`,
        `hp_start`,
        `mp_max`,
        `mp_growth`,
        `mp_start`,
        `attack_max`,
        `attack_growth`,
        `attack_start`,
        `defense_max`,
        `defense_growth`,
        `defense_start`,
        `hp_5s_max`,
        `hp_5s_growth`,
        `hp_5s_start`,
        `mp_5s_max`,
        `mp_5s_growth`,
        `mp_5s_start`,
        `attack_speed_max`,
        `attack_range`,
        `role_main`,
        `role_assist`,
        `birthdate`
    )
VALUES (
        10068,
        '百里守约',
        5611,
        185.1,
        3019,
        1784,
        96,
        440,
        410,
        15.86,
        188,
        329,
        16.79,
        94,
        68,
        2.071,
        39,
        38,
        1.571,
        16,
        0,
        '远程',
        '射手',
        '刺客',
        '2017-08-08'
    );

COMMIT;

-- ----------------------------
-- Table structure for orders
-- ----------------------------
DROP TABLE IF EXISTS `orders`;

CREATE TABLE `orders` (
    `Id` int DEFAULT NULL,
    `CustomerId` int DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of orders
-- ----------------------------
BEGIN;

INSERT INTO `orders` (`Id`, `CustomerId`) VALUES (1, 3);

INSERT INTO `orders` (`Id`, `CustomerId`) VALUES (2, 1);

COMMIT;

-- ----------------------------
-- Table structure for person
-- ----------------------------
DROP TABLE IF EXISTS `person`;

CREATE TABLE `person` (
    `PersonId` int DEFAULT NULL,
    `FirstName` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
    `LastName` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of person
-- ----------------------------
BEGIN;

INSERT INTO
    `person` (
        `PersonId`,
        `FirstName`,
        `LastName`
    )
VALUES (1, 'Allen', 'Wang');

COMMIT;

-- ----------------------------
-- Table structure for player
-- ----------------------------
DROP TABLE IF EXISTS `player`;

CREATE TABLE `player` (
    `player_id` int NOT NULL AUTO_INCREMENT COMMENT '球员ID',
    `team_id` int NOT NULL COMMENT '球队ID',
    `player_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '球员姓名',
    `height` float(3, 2) DEFAULT NULL COMMENT '球员身高',
    PRIMARY KEY (`player_id`) USING BTREE,
    UNIQUE KEY `player_name` (`player_name`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10050 DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of player
-- ----------------------------
BEGIN;

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10001, 1001, '韦恩-艾灵顿', 1.93);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10002, 1001, '雷吉-杰克逊', 1.91);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10003, 1001, '安德烈-德拉蒙德', 2.11);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10004, 1001, '索恩-马克', 2.16);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10005, 1001, '布鲁斯-布朗', 1.96);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10006, 1001, '兰斯顿-加洛韦', 1.88);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10007, 1001, '格伦-罗宾逊三世', 1.98);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10008, 1001, '伊斯梅尔-史密斯', 1.83);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10009, 1001, '扎扎-帕楚里亚', 2.11);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10010, 1001, '乔恩-洛伊尔', 2.08);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10011, 1001, '布雷克-格里芬', 2.08);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10012, 1001, '雷吉-巴洛克', 2.01);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10013, 1001, '卢克-肯纳德', 1.96);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10014, 1001, '斯坦利-约翰逊', 2.01);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10015, 1001, '亨利-埃伦森', 2.11);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10016, 1001, '凯里-托马斯', 1.91);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10017, 1001, '何塞-卡尔德隆', 1.91);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (
        10018,
        1001,
        '斯维亚托斯拉夫-米凯卢克',
        2.03
    );

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10019, 1001, '扎克-洛夫顿', 1.93);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10020, 1001, '卡林-卢卡斯', 1.85);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10021, 1002, '维克多-奥拉迪波', 1.93);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (
        10022,
        1002,
        '博扬-博格达诺维奇',
        2.03
    );

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (
        10023,
        1002,
        '多曼塔斯-萨博尼斯',
        2.11
    );

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10024, 1002, '迈尔斯-特纳', 2.11);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10025, 1002, '赛迪斯-杨', 2.03);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10026, 1002, '达伦-科里森', 1.83);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10027, 1002, '韦斯利-马修斯', 1.96);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10028, 1002, '泰瑞克-埃文斯', 1.98);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10029, 1002, '道格-迈克德莫特', 2.03);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10030, 1002, '科里-约瑟夫', 1.91);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10031, 1002, '阿龙-霍勒迪', 1.85);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10032, 1002, 'TJ-利夫', 2.08);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10033, 1002, '凯尔-奥奎因', 2.08);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10034, 1002, '埃德蒙-萨姆纳', 1.96);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10035, 1002, '达文-里德', 1.98);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10036, 1002, '阿利兹-约翰逊', 2.06);

INSERT INTO
    `player` (
        `player_id`,
        `team_id`,
        `player_name`,
        `height`
    )
VALUES (10037, 1002, '伊凯·阿尼博古', 2.08);

COMMIT;

-- ----------------------------
-- Table structure for player_score
-- ----------------------------
DROP TABLE IF EXISTS `player_score`;

CREATE TABLE `player_score` (
    `game_id` int NOT NULL COMMENT '比赛ID',
    `player_id` int NOT NULL COMMENT '球员ID',
    `is_first` tinyint(1) NOT NULL COMMENT '是否首发',
    `playing_time` int NOT NULL COMMENT '该球员本次比赛出场时间',
    `rebound` int NOT NULL COMMENT '篮板球',
    `rebound_o` int NOT NULL COMMENT '前场篮板',
    `rebound_d` int NOT NULL COMMENT '后场篮板',
    `assist` int NOT NULL COMMENT '助攻',
    `score` int NOT NULL COMMENT '比分',
    `steal` int NOT NULL COMMENT '抢断',
    `blockshot` int NOT NULL COMMENT '盖帽',
    `fault` int NOT NULL COMMENT '失误',
    `foul` int NOT NULL COMMENT '犯规',
    `shoot_attempts` int NOT NULL COMMENT '总出手',
    `shoot_hits` int NOT NULL COMMENT '命中',
    `shoot_3_attempts` int NOT NULL COMMENT '3分出手',
    `shoot_3_hits` int NOT NULL COMMENT '3分命中',
    `shoot_p_attempts` int NOT NULL COMMENT '罚球出手',
    `shoot_p_hits` int NOT NULL COMMENT '罚球命中'
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of player_score
-- ----------------------------
BEGIN;

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10001,
        1,
        38,
        4,
        1,
        3,
        2,
        26,
        0,
        1,
        0,
        3,
        19,
        10,
        13,
        4,
        4,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10002,
        1,
        30,
        6,
        4,
        2,
        4,
        22,
        0,
        0,
        6,
        3,
        19,
        8,
        5,
        1,
        5,
        5
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10003,
        1,
        37,
        17,
        7,
        10,
        5,
        18,
        4,
        0,
        3,
        4,
        18,
        8,
        1,
        0,
        5,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10004,
        1,
        42,
        6,
        1,
        5,
        2,
        14,
        0,
        4,
        1,
        2,
        10,
        4,
        7,
        4,
        2,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10005,
        1,
        19,
        2,
        0,
        2,
        2,
        0,
        2,
        0,
        1,
        1,
        1,
        0,
        1,
        0,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10006,
        0,
        23,
        2,
        2,
        0,
        1,
        9,
        1,
        0,
        0,
        2,
        10,
        3,
        3,
        2,
        1,
        1
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10007,
        0,
        13,
        1,
        1,
        0,
        1,
        7,
        0,
        0,
        0,
        2,
        4,
        2,
        2,
        1,
        2,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10008,
        0,
        20,
        2,
        0,
        2,
        3,
        6,
        0,
        0,
        3,
        3,
        5,
        3,
        0,
        0,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10009,
        0,
        11,
        1,
        0,
        1,
        1,
        0,
        0,
        0,
        1,
        4,
        0,
        0,
        0,
        0,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10001,
        10010,
        0,
        7,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        2,
        0,
        1,
        0,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10022,
        1,
        37,
        7,
        1,
        6,
        6,
        19,
        3,
        0,
        1,
        3,
        16,
        7,
        3,
        1,
        4,
        4
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10025,
        1,
        34,
        9,
        1,
        8,
        5,
        19,
        0,
        0,
        5,
        1,
        12,
        8,
        0,
        0,
        4,
        3
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10024,
        1,
        34,
        6,
        0,
        6,
        0,
        17,
        3,
        5,
        0,
        2,
        7,
        5,
        3,
        2,
        6,
        5
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10028,
        1,
        27,
        3,
        0,
        3,
        3,
        13,
        1,
        1,
        3,
        1,
        10,
        4,
        6,
        4,
        2,
        1
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10030,
        1,
        31,
        1,
        0,
        1,
        3,
        4,
        2,
        0,
        1,
        2,
        9,
        2,
        3,
        0,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10023,
        0,
        23,
        12,
        4,
        8,
        3,
        18,
        0,
        0,
        3,
        6,
        10,
        8,
        0,
        0,
        2,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10029,
        0,
        24,
        2,
        1,
        1,
        2,
        11,
        0,
        0,
        1,
        2,
        8,
        5,
        3,
        1,
        0,
        0
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10031,
        0,
        25,
        1,
        0,
        1,
        5,
        10,
        0,
        1,
        2,
        3,
        4,
        3,
        3,
        2,
        4,
        2
    );

INSERT INTO
    `player_score` (
        `game_id`,
        `player_id`,
        `is_first`,
        `playing_time`,
        `rebound`,
        `rebound_o`,
        `rebound_d`,
        `assist`,
        `score`,
        `steal`,
        `blockshot`,
        `fault`,
        `foul`,
        `shoot_attempts`,
        `shoot_hits`,
        `shoot_3_attempts`,
        `shoot_3_hits`,
        `shoot_p_attempts`,
        `shoot_p_hits`
    )
VALUES (
        10002,
        10032,
        0,
        4,
        1,
        0,
        1,
        0,
        0,
        0,
        1,
        1,
        0,
        1,
        0,
        1,
        0,
        0,
        0
    );

COMMIT;

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;

CREATE TABLE `student` (
    `SId` varchar(10) DEFAULT NULL,
    `Sname` varchar(10) DEFAULT NULL,
    `Sage` datetime DEFAULT NULL,
    `Ssex` varchar(10) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of student
-- ----------------------------
BEGIN;

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '01',
        '赵雷',
        '1990-01-01 00:00:00',
        '男'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '02',
        '钱电',
        '1990-12-21 00:00:00',
        '男'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '03',
        '孙风',
        '1990-05-20 00:00:00',
        '男'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '04',
        '李云',
        '1990-08-06 00:00:00',
        '男'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '05',
        '周梅',
        '1991-12-01 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '06',
        '吴兰',
        '1992-03-01 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '07',
        '郑竹',
        '1989-07-01 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '08',
        '张诚',
        '1990-10-11 00:00:00',
        '男'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '09',
        '张三',
        '2017-12-20 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '10',
        '李四',
        '2017-12-25 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '11',
        '李墨',
        '2017-12-30 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '12',
        '赵六',
        '2017-01-01 00:00:00',
        '女'
    );

INSERT INTO
    `student` (
        `SId`,
        `Sname`,
        `Sage`,
        `Ssex`
    )
VALUES (
        '13',
        '孙策',
        '2018-01-01 00:00:00',
        '女'
    );

COMMIT;

-- ----------------------------
-- Table structure for team
-- ----------------------------
DROP TABLE IF EXISTS `team`;

CREATE TABLE `team` (
    `team_id` int NOT NULL COMMENT '球队ID',
    `team_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '球队名称',
    PRIMARY KEY (`team_id`) USING BTREE
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of team
-- ----------------------------
BEGIN;

INSERT INTO `team` (`team_id`, `team_name`) VALUES (1001, '底特律活塞');

INSERT INTO `team` (`team_id`, `team_name`) VALUES (1002, '印第安纳步行者');

INSERT INTO `team` (`team_id`, `team_name`) VALUES (1003, '亚特兰大老鹰');

INSERT INTO `team` (`team_id`, `team_name`) VALUES (1004, 'abcd');

COMMIT;

-- ----------------------------
-- Table structure for team_score
-- ----------------------------
DROP TABLE IF EXISTS `team_score`;

CREATE TABLE `team_score` (
    `game_id` int NOT NULL COMMENT '比赛ID',
    `h_team_id` int NOT NULL COMMENT '主队ID',
    `v_team_id` int NOT NULL COMMENT '客队ID',
    `h_team_score` int NOT NULL COMMENT '主队得分',
    `v_team_score` int NOT NULL COMMENT '客队得分',
    `game_date` date DEFAULT NULL COMMENT '比赛时间',
    PRIMARY KEY (`game_id`) USING BTREE
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of team_score
-- ----------------------------
BEGIN;

INSERT INTO
    `team_score` (
        `game_id`,
        `h_team_id`,
        `v_team_id`,
        `h_team_score`,
        `v_team_score`,
        `game_date`
    )
VALUES (
        10001,
        1001,
        1002,
        102,
        111,
        '2019-04-01'
    );

INSERT INTO
    `team_score` (
        `game_id`,
        `h_team_id`,
        `v_team_id`,
        `h_team_score`,
        `v_team_score`,
        `game_date`
    )
VALUES (
        10002,
        1002,
        1003,
        135,
        134,
        '2019-04-10'
    );

COMMIT;

-- ----------------------------
-- Table structure for test_work
-- ----------------------------
DROP TABLE IF EXISTS `test_work`;

CREATE TABLE `test_work` (
    `xitong` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
    `people` varchar(100) DEFAULT NULL,
    `table_jc` varchar(100) DEFAULT NULL,
    `table_zwm` varchar(100) DEFAULT NULL,
    `ziduan` varchar(100) DEFAULT NULL,
    `ziduan_zwm` varchar(100) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of test_work
-- ----------------------------
BEGIN;

INSERT INTO
    `test_work` (
        `xitong`,
        `people`,
        `table_jc`,
        `table_zwm`,
        `ziduan`,
        `ziduan_zwm`
    )
VALUES (
        '核心系统',
        '魏文哲',
        'SYM_RB_TDA',
        '定期帐户信息表',
        'MATURITY_DATE',
        ''
    );

INSERT INTO
    `test_work` (
        `xitong`,
        `people`,
        `table_jc`,
        `table_zwm`,
        `ziduan`,
        `ziduan_zwm`
    )
VALUES (
        '核心系统',
        '魏文哲',
        'SYM_RB_TDA',
        '定期帐户信息表',
        'MATURITY_DATE1',
        NULL
    );

COMMIT;

-- ----------------------------
-- Table structure for trips
-- ----------------------------
DROP TABLE IF EXISTS `trips`;

CREATE TABLE `trips` (
    `Id` int DEFAULT NULL,
    `Client_Id` int DEFAULT NULL,
    `Driver_Id` int DEFAULT NULL,
    `City_Id` int DEFAULT NULL,
    `Status` enum(
        'completed',
        'cancelled_by_driver',
        'cancelled_by_client'
    ) DEFAULT NULL,
    `Request_at` varchar(50) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of trips
-- ----------------------------
BEGIN;

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        1,
        1,
        10,
        1,
        'completed',
        '2013-10-01'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        2,
        2,
        11,
        1,
        'cancelled_by_driver',
        '2013-10-01'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        3,
        3,
        12,
        6,
        'completed',
        '2013-10-01'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        4,
        4,
        13,
        6,
        'cancelled_by_client',
        '2013-10-01'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        5,
        1,
        10,
        1,
        'completed',
        '2013-10-02'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        6,
        2,
        11,
        6,
        'completed',
        '2013-10-02'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        7,
        3,
        12,
        6,
        'completed',
        '2013-10-02'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        8,
        2,
        12,
        12,
        'completed',
        '2013-10-03'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        9,
        3,
        10,
        12,
        'completed',
        '2013-10-03'
    );

INSERT INTO
    `trips` (
        `Id`,
        `Client_Id`,
        `Driver_Id`,
        `City_Id`,
        `Status`,
        `Request_at`
    )
VALUES (
        10,
        4,
        13,
        12,
        'cancelled_by_driver',
        '2013-10-03'
    );

COMMIT;

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
    `user_id` int NOT NULL AUTO_INCREMENT,
    `gender` varchar(255) NOT NULL,
    `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
    `asset` float DEFAULT NULL,
    `role` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
    `birthdate` date DEFAULT NULL,
    `bank_id` int DEFAULT NULL,
    `tag` varchar(100) DEFAULT NULL,
    PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10069 DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of user
-- ----------------------------
BEGIN;

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10000,
        '男',
        '夏侯惇',
        7350,
        '学生',
        '1996-07-19',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10001,
        '女',
        '钟无艳',
        9500,
        '教师',
        '1991-05-01',
        1001,
        '资产最高'
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10002,
        '男',
        '张飞',
        8341,
        '学生',
        '1992-05-04',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10003,
        '男',
        '牛魔',
        8476,
        '学生',
        '1995-11-24',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10004,
        '男',
        '吕布',
        7344,
        '教师',
        '1995-12-22',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10005,
        '男',
        '亚瑟',
        8050,
        '教师',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10006,
        '男',
        '芈月',
        6164,
        '公务员',
        '1995-12-08',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10007,
        '男',
        '程咬金',
        8611,
        '学生',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10008,
        '男',
        '廉颇',
        9328,
        '学生',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10009,
        '男',
        '东皇太一',
        7669,
        '学生',
        '1997-03-30',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10010,
        '男',
        '庄周',
        8149,
        '员工',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10011,
        '男',
        '太乙真人',
        6835,
        '员工',
        '1986-11-24',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10012,
        '男',
        '白起',
        8638,
        '学生',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10013,
        '女',
        '雅典娜',
        6264,
        '教师',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10014,
        '男',
        '刘邦',
        8073,
        '学生',
        '1986-04-26',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10015,
        '男',
        '刘禅',
        8581,
        '学生',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10016,
        '男',
        '墨子',
        7176,
        '公务员',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10017,
        '男',
        '项羽',
        8057,
        '学生',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10018,
        '男',
        '关羽',
        7107,
        '教师',
        '1986-06-28',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10019,
        '男',
        '后羿',
        5986,
        '经理',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10020,
        '男',
        '马可波罗',
        5584,
        '经理',
        '1996-08-23',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10021,
        '男',
        '鲁班七号',
        5989,
        '经理',
        NULL,
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10022,
        '男',
        '李元芳',
        5725,
        '经理',
        '1996-04-12',
        1001,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10023,
        '女',
        '孙尚香',
        6014,
        '经理',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10024,
        '男',
        '黄忠',
        5898,
        '经理',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10025,
        '男',
        '狄仁杰',
        5710,
        '经理',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10026,
        '女',
        '虞姬',
        5669,
        '经理',
        '1996-05-24',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10027,
        '男',
        '成吉思汗',
        5799,
        '经理',
        '1986-09-27',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10028,
        '男',
        '嬴政',
        5471,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10029,
        '女',
        '武则天',
        5037,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10030,
        '女',
        '露娜',
        6612,
        '教师',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10031,
        '女',
        '甄姬',
        5584,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10032,
        '女',
        '妲己',
        5824,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10033,
        '男',
        '干将莫邪',
        5583,
        '公务员',
        '1997-05-22',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10034,
        '男',
        '姜子牙',
        5399,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10035,
        '女',
        '王昭君',
        5429,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10036,
        '男',
        '诸葛亮',
        5655,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10037,
        '女',
        '不知火舞',
        6014,
        '公务员',
        '1996-05-12',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10038,
        '女',
        '貂蝉',
        5611,
        '公务员',
        '1995-12-15',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10039,
        '男',
        '孙膑',
        6811,
        '员工',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10040,
        '女',
        '安琪拉',
        5994,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10041,
        '女',
        '小乔',
        5916,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10042,
        '男',
        '周瑜',
        5513,
        '公务员',
        '1995-11-10',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10043,
        '男',
        '张良',
        5799,
        '公务员',
        '1995-10-26',
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10044,
        '男',
        '高渐离',
        6165,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10045,
        '男',
        '扁鹊',
        6703,
        '公务员',
        NULL,
        1002,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10046,
        '男',
        '钟馗',
        6280,
        '公务员',
        '1996-03-24',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10047,
        '女',
        '大乔',
        5399,
        '员工',
        '1997-02-28',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10048,
        '男',
        '鬼谷子',
        7107,
        '员工',
        '1997-06-29',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10049,
        '女',
        '蔡文姬',
        5910,
        '员工',
        '1996-07-08',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10050,
        '女',
        '花木兰',
        5397,
        '教师',
        '1996-01-01',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10051,
        '男',
        '赵云',
        6732,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10052,
        '男',
        '橘石京',
        7000,
        '个体户',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10053,
        '男',
        '李白',
        5483,
        '个体户',
        '1986-03-01',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10054,
        '男',
        '韩信',
        5655,
        '个体户',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10055,
        '男',
        '杨戬',
        7420,
        '教师',
        '1986-10-11',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10056,
        '男',
        '达摩',
        7140,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10057,
        '男',
        '孙悟空',
        6585,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10058,
        '男',
        '刘备',
        6900,
        '教师',
        '1986-02-02',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10059,
        '男',
        '曹操',
        7473,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10060,
        '男',
        '典韦',
        7516,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10061,
        '男',
        '宫本武藏',
        6210,
        '教师',
        '1985-10-30',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10062,
        '男',
        '老夫子',
        7155,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10063,
        '男',
        '哪吒',
        7268,
        '教师',
        '1997-01-12',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10064,
        '女',
        '阿轲',
        5968,
        '个体户',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10065,
        '女',
        '娜可露露',
        6205,
        '个体户',
        '1996-02-22',
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10066,
        '男',
        '兰陵王',
        6232,
        '个体户',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10067,
        '男',
        '铠',
        6700,
        '教师',
        NULL,
        1003,
        NULL
    );

INSERT INTO
    `user` (
        `user_id`,
        `gender`,
        `name`,
        `asset`,
        `role`,
        `birthdate`,
        `bank_id`,
        `tag`
    )
VALUES (
        10068,
        '男',
        '百里守约',
        5611,
        '经理',
        '1997-08-08',
        1003,
        NULL
    );

COMMIT;

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
    `Users_Id` int DEFAULT NULL,
    `Banned` varchar(50) DEFAULT NULL,
    `Role` enum('client', 'driver', 'partner') DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of users
-- ----------------------------
BEGIN;

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (1, 'No', 'client');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (2, 'Yes', 'client');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (3, 'No', 'client');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (4, 'No', 'client');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (10, 'No', 'driver');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (11, 'No', 'driver');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (12, 'No', 'driver');

INSERT INTO
    `users` (`Users_Id`, `Banned`, `Role`)
VALUES (13, 'No', 'driver');

COMMIT;

-- ----------------------------
-- Table structure for using
-- ----------------------------
DROP TABLE IF EXISTS `using`;

CREATE TABLE `using` (
    `dept_id` int DEFAULT NULL,
    `form_id` int DEFAULT NULL,
    `status` varchar(1) DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb3;

-- ----------------------------
-- Records of using
-- ----------------------------
BEGIN;

INSERT INTO
    `using` (
        `dept_id`,
        `form_id`,
        `status`
    )
VALUES (10, 1, '0');

INSERT INTO
    `using` (
        `dept_id`,
        `form_id`,
        `status`
    )
VALUES (11, 1, '0');

INSERT INTO
    `using` (
        `dept_id`,
        `form_id`,
        `status`
    )
VALUES (12, 1, '1');

COMMIT;

-- ----------------------------
-- Table structure for weather
-- ----------------------------
DROP TABLE IF EXISTS `weather`;

CREATE TABLE `weather` (
    `Id` int DEFAULT NULL,
    `RecordDate` date DEFAULT NULL,
    `Temperature` int DEFAULT NULL
) ENGINE = InnoDB DEFAULT CHARSET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of weather
-- ----------------------------
BEGIN;

INSERT INTO
    `weather` (
        `Id`,
        `RecordDate`,
        `Temperature`
    )
VALUES (1, '2015-01-01', 10);

INSERT INTO
    `weather` (
        `Id`,
        `RecordDate`,
        `Temperature`
    )
VALUES (2, '2015-01-02', 25);

INSERT INTO
    `weather` (
        `Id`,
        `RecordDate`,
        `Temperature`
    )
VALUES (3, '2015-01-03', 20);

INSERT INTO
    `weather` (
        `Id`,
        `RecordDate`,
        `Temperature`
    )
VALUES (4, '2015-01-04', 30);

COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
